_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПредопределенныеЭлементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ПредопределенныеЭлементы</Name>
			<Comment>Предопределенные элементы (УСО)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Список</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначенийСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ПредопределенныеЭлементы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
		
	УстановитьВидимость();
	
	СписокДоИзменения = Объект.Список;
	
	СтруктураТипа = Справочники.УСОERP_ПредопределенныеЭлементы.ПолучитьТипПредопределенногоЭлемента(Объект.Ссылка);
	Элементы.Список.Видимость =  СтруктураТипа.Список;
	
	Если СтруктураТипа.Тип <> Неопределено Тогда
		
		Элементы.Значение.ВыбиратьТип = Ложь;
		Элементы.Значение.ДоступныеТипы = СтруктураТипа.Тип;
		Элементы.Значение.ОграничениеТипа = СтруктураТипа.Тип;  	
				
		Элементы.СписокЗначенийЗначение.ВыбиратьТип = Ложь;
		Элементы.СписокЗначенийЗначение.ДоступныеТипы = СтруктураТипа.Тип;
		Элементы.СписокЗначенийЗначение.ОграничениеТипа = СтруктураТипа.Тип;
		Элементы.Значение.КнопкаВыбора = Истина;
		Элементы.СписокЗначенийЗначение.КнопкаВыбора = Истина;
		
		Если СтруктураТипа.Тип = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный") Тогда
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ЗапретитьИспользоватьВПроводках", Ложь);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);			
			Элементы.Значение.ПараметрыВыбора = НовыеПараметры;
			Элементы.СписокЗначенийЗначение.ПараметрыВыбора = НовыеПараметры;
			
		КонецЕсли; 
		
	КонецЕсли; 	
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.СписокЗначений.Видимость = Объект.Список;
	Элементы.Значение.Видимость = НЕ Объект.Список;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	УстановитьВидимость();
	
			
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатурнойГруппыДляЗаполненияЗначения(ВыбранноеЗначение, Параметр2) Экспорт
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.Значение = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
